3 important abstract in pandas 
DataFrame, Series and Index

In [1]:
import pandas as pd

Everything has to be of same type in series
Example - column in data

In [2]:
obj = pd.Series([-1, 2, -3, 4, -5])
obj

0   -1
1    2
2   -3
3    4
4   -5
dtype: int64

In [3]:
type(obj)

pandas.core.series.Series

In [4]:
obj[0]

-1

In [5]:
obj[1:4]

1    2
2   -3
3    4
dtype: int64

In [6]:
I = obj > 0
I
#Interesting

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [7]:
print(obj[I])

1    2
3    4
dtype: int64

In [8]:
obj2 = pd.Series([-1, 2, -3, 4, -5,"a","3"])
obj2

0    -1
1     2
2    -3
3     4
4    -5
5     a
6     3
dtype: object

In [9]:
print(obj2.dtype)
obj2.dtype

object

dtype('O')

Series much much faster than lists

In [10]:
obj2.index

RangeIndex(start=0, stop=7, step=1)

In [11]:
obj2.values

array([-1, 2, -3, 4, -5, 'a', '3'], dtype=object)

Look at what happens here! Interesting!!!
Indexes being used to get that value from the object

In [12]:
I = [1,2,3,4]
obj2[I]
#Interesting

1     2
2    -3
3     4
4    -5
dtype: object

Names being used as index!
Interesting

In [13]:
obj3 = pd.Series([      1,    -2,       3,     -4,        5,      -6],
              ['alice', 'bob', 'carol', 'dave', 'esther', 'frank'])
obj3

alice     1
bob      -2
carol     3
dave     -4
esther    5
frank    -6
dtype: int64

In [14]:
obj3["bob"]

-2

In [15]:
obj3 > 0

alice      True
bob       False
carol      True
dave      False
esther     True
frank     False
dtype: bool

In [16]:
obj3[obj3 > 0]

alice     1
carol     3
esther    5
dtype: int64

2 things to remember
Index you set up should be unique
Values should be of same type
Series behaves like dictionary and lists

In [17]:
p = {'alice': 1, 'carol': 3, 'esther': 5, 'bob': -2, 'dave': -4, 'frank': -6}
obj4 = pd.Series(p.keys(),p.values())
obj4

 1     alice
 3     carol
 5    esther
-2       bob
-4      dave
-6     frank
dtype: object

In [18]:
obj4 = pd.Series(p)
obj4

alice     1
carol     3
esther    5
bob      -2
dave     -4
frank    -6
dtype: int64

When you dereference, if the indexes are compatible only then it works

In [19]:
mujeres = [0, 2, 4] # list of integer offsets
obj4[mujeres]

alice     1
esther    5
dave     -4
dtype: int64

In [20]:
obj4

alice     1
carol     3
esther    5
bob      -2
dave     -4
frank    -6
dtype: int64

In [21]:
"alice" in obj4

True

In [22]:
obj4.isin({1})

alice      True
carol     False
esther    False
bob       False
dave      False
frank     False
dtype: bool

In [23]:
obj4 + 5

alice      6
carol      8
esther    10
bob        3
dave       1
frank     -1
dtype: int64

In [24]:
abs(-5)

5

In [25]:
obj3

alice     1
bob      -2
carol     3
dave     -4
esther    5
frank    -6
dtype: int64

In [26]:
obj3.apply(abs)

alice     1
bob       2
carol     3
dave      4
esther    5
frank     6
dtype: int64

In [27]:
obj3.name = "yo"
obj3.name

'yo'

Dataframe is constructed is that every column is a series
It is a series of series of objects

In [28]:
cafes = pd.DataFrame({'name': ['east pole', 'chrome yellow', 'brash', 'taproom', '3heart', 'spiller park pcm', 'refuge', 'toptime'],
                   'zip': [30324, 30312, 30318, 30317, 30306, 30308, 30303, 30318],
                   'poc': ['jared', 'kelly', 'matt', 'jonathan', 'nhan', 'dale', 'kitti', 'nolan']})
print("type:", type(cafes))
print(cafes)

type: <class 'pandas.core.frame.DataFrame'>
               name    zip       poc
0         east pole  30324     jared
1     chrome yellow  30312     kelly
2             brash  30318      matt
3           taproom  30317  jonathan
4            3heart  30306      nhan
5  spiller park pcm  30308      dale
6            refuge  30303     kitti
7           toptime  30318     nolan

Everything has the same index here
Indexes of the series have to be aligned if you create it using a series

In [29]:
cafes.columns

Index(['name', 'zip', 'poc'], dtype='object')

In [30]:
cafes.zip.index

RangeIndex(start=0, stop=8, step=1)

In [31]:
cafes.index

RangeIndex(start=0, stop=8, step=1)

This means columns

In [32]:
cafes[["zip","name"]]

     zip              name
0  30324         east pole
1  30312     chrome yellow
2  30318             brash
3  30317           taproom
4  30306            3heart
5  30308  spiller park pcm
6  30303            refuge
7  30318           toptime

Slices means rows

In [33]:
cafes[1::2]

               name    zip       poc
1     chrome yellow  30312     kelly
3           taproom  30317  jonathan
5  spiller park pcm  30308      dale
7           toptime  30318     nolan

In [34]:
cafes[0:1]

        name    zip    poc
0  east pole  30324  jared

In [35]:
cafes2 = cafes[['poc', 'zip']]
cafes2.index = cafes['name']
#cafes2.index.name = None
cafes2

                       poc    zip
name
east pole            jared  30324
chrome yellow        kelly  30312
brash                 matt  30318
taproom           jonathan  30317
3heart                nhan  30306
spiller park pcm      dale  30308
refuge               kitti  30303
toptime              nolan  30318

In [36]:
cafes2 = cafes[['poc', 'zip']]
cafes2.index = cafes['name']
cafes2.index.name = None
cafes2

                       poc    zip
east pole            jared  30324
chrome yellow        kelly  30312
brash                 matt  30318
taproom           jonathan  30317
3heart                nhan  30306
spiller park pcm      dale  30308
refuge               kitti  30303
toptime              nolan  30318

In [37]:
cafes.loc[1:3]
#should correspond to the index of the dataframe

            name    zip       poc
1  chrome yellow  30312     kelly
2          brash  30318      matt
3        taproom  30317  jonathan

In [38]:
cafes2.loc[["east pole","refuge"]]
#should correspond to the index of the dataframe

             poc    zip
east pole  jared  30324
refuge     kitti  30303

In [39]:
cafes2.iloc[[1,3]]

                    poc    zip
chrome yellow     kelly  30312
taproom        jonathan  30317

In [40]:
cafes2.iloc[0:6]

                       poc    zip
east pole            jared  30324
chrome yellow        kelly  30312
brash                 matt  30318
taproom           jonathan  30317
3heart                nhan  30306
spiller park pcm      dale  30308

In [41]:
cafes

               name    zip       poc
0         east pole  30324     jared
1     chrome yellow  30312     kelly
2             brash  30318      matt
3           taproom  30317  jonathan
4            3heart  30306      nhan
5  spiller park pcm  30308      dale
6            refuge  30303     kitti
7           toptime  30318     nolan

In [42]:
cafes["rating"] = 4

In [43]:
def calc_value(row):
    return row['rating'] / 2

cafes['value'] = cafes.apply(calc_value, axis=1)
cafes

               name    zip       poc  rating  value
0         east pole  30324     jared       4    2.0
1     chrome yellow  30312     kelly       4    2.0
2             brash  30318      matt       4    2.0
3           taproom  30317  jonathan       4    2.0
4            3heart  30306      nhan       4    2.0
5  spiller park pcm  30308      dale       4    2.0
6            refuge  30303     kitti       4    2.0
7           toptime  30318     nolan       4    2.0

Use the above to apply row by row

In [44]:
is_cheap = cafes['zip'] <= 30312
#creates boolean series (True and False)
cafes_location = cafes[is_cheap]
cafes_location2 = cafes[~is_cheap]

pd.concat([cafes_location, cafes_location2])

               name    zip       poc  rating  value
1     chrome yellow  30312     kelly       4    2.0
4            3heart  30306      nhan       4    2.0
5  spiller park pcm  30308      dale       4    2.0
6            refuge  30303     kitti       4    2.0
0         east pole  30324     jared       4    2.0
2             brash  30318      matt       4    2.0
3           taproom  30317  jonathan       4    2.0
7           toptime  30318     nolan       4    2.0

More on Index !

In [45]:
cafes2 = cafes[['poc', 'zip']]
cafes2.index = cafes['name']
cafes2.index.name = None
cafes2

                       poc    zip
east pole            jared  30324
chrome yellow        kelly  30312
brash                 matt  30318
taproom           jonathan  30317
3heart                nhan  30306
spiller park pcm      dale  30308
refuge               kitti  30303
toptime              nolan  30318

In [46]:
cafes2.index

Index(['east pole', 'chrome yellow', 'brash', 'taproom', '3heart',
       'spiller park pcm', 'refuge', 'toptime'],
      dtype='object')

In [47]:
cafes2.index.isin(['brash', '3heart'])

array([False, False,  True, False,  True, False, False, False])

In [48]:
cafes2.index.union(['chattahoochee'])

Index(['3heart', 'brash', 'chattahoochee', 'chrome yellow', 'east pole',
       'refuge', 'spiller park pcm', 'taproom', 'toptime'],
      dtype='object')

In [49]:
cafes2.index

Index(['east pole', 'chrome yellow', 'brash', 'taproom', '3heart',
       'spiller park pcm', 'refuge', 'toptime'],
      dtype='object')

In [50]:
cafes2

                       poc    zip
east pole            jared  30324
chrome yellow        kelly  30312
brash                 matt  30318
taproom           jonathan  30317
3heart                nhan  30306
spiller park pcm      dale  30308
refuge               kitti  30303
toptime              nolan  30318

In [51]:
cafes2.index.difference(['chattahoochee', 'starbucks', 'bar crema'])

Index(['3heart', 'brash', 'chrome yellow', 'east pole', 'refuge',
       'spiller park pcm', 'taproom', 'toptime'],
      dtype='object')

In [52]:
cafes5 = cafes2.reindex(pd.Index(['3heart', 'east pole', 'brash', 'starbucks']))

display(cafes2)
display(cafes5)

                       poc    zip
east pole            jared  30324
chrome yellow        kelly  30312
brash                 matt  30318
taproom           jonathan  30317
3heart                nhan  30306
spiller park pcm      dale  30308
refuge               kitti  30303
toptime              nolan  30318

             poc      zip
3heart      nhan  30306.0
east pole  jared  30324.0
brash       matt  30318.0
starbucks    NaN      NaN

In [53]:
cafes6 = cafes2.reset_index(drop=True)
cafes6['name'] = cafes2.index
cafes6

        poc    zip              name
0     jared  30324         east pole
1     kelly  30312     chrome yellow
2      matt  30318             brash
3  jonathan  30317           taproom
4      nhan  30306            3heart
5      dale  30308  spiller park pcm
6     kitti  30303            refuge
7     nolan  30318           toptime

In [54]:
cafes

               name    zip       poc  rating  value
0         east pole  30324     jared       4    2.0
1     chrome yellow  30312     kelly       4    2.0
2             brash  30318      matt       4    2.0
3           taproom  30317  jonathan       4    2.0
4            3heart  30306      nhan       4    2.0
5  spiller park pcm  30308      dale       4    2.0
6            refuge  30303     kitti       4    2.0
7           toptime  30318     nolan       4    2.0

In [55]:
cafes2['rating'] = 4.0
cafes2['price'] = '$$'
cafes2

c:\users\ayush\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
c:\users\ayush\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

                       poc    zip  rating price
east pole            jared  30324     4.0    $$
chrome yellow        kelly  30312     4.0    $$
brash                 matt  30318     4.0    $$
taproom           jonathan  30317     4.0    $$
3heart                nhan  30306     4.0    $$
spiller park pcm      dale  30308     4.0    $$
refuge               kitti  30303     4.0    $$
toptime              nolan  30318     4.0    $$

In [56]:
prices_as_ints = cafes2['price'].apply(lambda s: len(s))
prices_as_ints

east pole           2
chrome yellow       2
brash               2
taproom             2
3heart              2
spiller park pcm    2
refuge              2
toptime             2
Name: price, dtype: int64

In [57]:
cafes2['value'] = cafes2['rating'] / prices_as_ints
cafes2

                       poc    zip  rating price  value
east pole            jared  30324     4.0    $$    2.0
chrome yellow        kelly  30312     4.0    $$    2.0
brash                 matt  30318     4.0    $$    2.0
taproom           jonathan  30317     4.0    $$    2.0
3heart                nhan  30306     4.0    $$    2.0
spiller park pcm      dale  30308     4.0    $$    2.0
refuge               kitti  30303     4.0    $$    2.0
toptime              nolan  30318     4.0    $$    2.0

In [58]:
cafes3 = cafes2.copy()
cafes3

                       poc    zip  rating price  value
east pole            jared  30324     4.0    $$    2.0
chrome yellow        kelly  30312     4.0    $$    2.0
brash                 matt  30318     4.0    $$    2.0
taproom           jonathan  30317     4.0    $$    2.0
3heart                nhan  30306     4.0    $$    2.0
spiller park pcm      dale  30308     4.0    $$    2.0
refuge               kitti  30303     4.0    $$    2.0
toptime              nolan  30318     4.0    $$    2.0

In [59]:
is_fancy = cafes3['zip'].isin({30306, 30308})
# Alternative:
#is_fancy = cafes3['zip'].apply(lambda z: z in {30306, 30308})
is_fancy

east pole           False
chrome yellow       False
brash               False
taproom             False
3heart               True
spiller park pcm     True
refuge              False
toptime             False
Name: zip, dtype: bool

In [60]:
cafes3[is_fancy]

                   poc    zip  rating price  value
3heart            nhan  30306     4.0    $$    2.0
spiller park pcm  dale  30308     4.0    $$    2.0

In [61]:
cafes3[~is_fancy]

                    poc    zip  rating price  value
east pole         jared  30324     4.0    $$    2.0
chrome yellow     kelly  30312     4.0    $$    2.0
brash              matt  30318     4.0    $$    2.0
taproom        jonathan  30317     4.0    $$    2.0
refuge            kitti  30303     4.0    $$    2.0
toptime           nolan  30318     4.0    $$    2.0

In [62]:
cafes3

                       poc    zip  rating price  value
east pole            jared  30324     4.0    $$    2.0
chrome yellow        kelly  30312     4.0    $$    2.0
brash                 matt  30318     4.0    $$    2.0
taproom           jonathan  30317     4.0    $$    2.0
3heart                nhan  30306     4.0    $$    2.0
spiller park pcm      dale  30308     4.0    $$    2.0
refuge               kitti  30303     4.0    $$    2.0
toptime              nolan  30318     4.0    $$    2.0

In [63]:
cafes3.loc[is_fancy, 'price'] += '$'
cafes3

                       poc    zip  rating price  value
east pole            jared  30324     4.0    $$    2.0
chrome yellow        kelly  30312     4.0    $$    2.0
brash                 matt  30318     4.0    $$    2.0
taproom           jonathan  30317     4.0    $$    2.0
3heart                nhan  30306     4.0   $$$    2.0
spiller park pcm      dale  30308     4.0   $$$    2.0
refuge               kitti  30303     4.0    $$    2.0
toptime              nolan  30318     4.0    $$    2.0

You can have a particular index as well in place of is_fancy
Error above gives hint - c:\users\ayush\appdata\local\programs\python\python39\lib\site-packages\pandas\core\frame.py:3607: SettingWithCopyWarning: 
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

In [64]:
cafes3["zip"]["3heart"]

30306

In [65]:
cafes3.iloc[4][1]

30306

Method 2

In [66]:
cafes4 = cafes2.copy()
cafes4['price'] += pd.Series([x * '$' for x in is_fancy.tolist()], index=is_fancy.index)
cafes4

                       poc    zip  rating price  value
east pole            jared  30324     4.0    $$    2.0
chrome yellow        kelly  30312     4.0    $$    2.0
brash                 matt  30318     4.0    $$    2.0
taproom           jonathan  30317     4.0    $$    2.0
3heart                nhan  30306     4.0   $$$    2.0
spiller park pcm      dale  30308     4.0   $$$    2.0
refuge               kitti  30303     4.0    $$    2.0
toptime              nolan  30318     4.0    $$    2.0

apply is for column if applied on dataset,
apply is for every row if done on one column of dataset!!!
Very important.
See that last soln of exercise!

In [67]:
#filter
cafes[cafes.zip > 30323]

        name    zip    poc  rating  value
0  east pole  30324  jared       4    2.0

In [68]:
#var_names = sorted(X.columns)
#sort
cafes.sort_values(by = ["zip","rating"], ascending = [False,True])

               name    zip       poc  rating  value
0         east pole  30324     jared       4    2.0
2             brash  30318      matt       4    2.0
7           toptime  30318     nolan       4    2.0
3           taproom  30317  jonathan       4    2.0
1     chrome yellow  30312     kelly       4    2.0
5  spiller park pcm  30308      dale       4    2.0
4            3heart  30306      nhan       4    2.0
6            refuge  30303     kitti       4    2.0

In [69]:
#rename
cafes.rename(columns = {"name":"namee","value":"valuee"},inplace=True)

In [70]:
#unique
cafes.zip.unique()

array([30324, 30312, 30318, 30317, 30306, 30308, 30303], dtype=int64)

In [71]:
cafes.zip.nunique()

7

In [72]:
#delete
del cafes["valuee"]

In [73]:
# C = A.merge (B, on=['country', 'year'])
# C = A.merge (B, on=['country', 'year'], how = "right")
# C = A.merge (B, left_on=['country'],right_on = ['year'], how = "right")

In [74]:
# df_plot.dropna(inplace=True)
# who3.drop("case_type", axis=1, inplace = True)

In [75]:
# A.equals(B)

In [76]:
# pd.concat([df, a], axis=1).drop(columns = key)

In [77]:
# who3 = who2.copy()

# def type(d):
#     if 'rel' in d:
#         return 'rel'
#     elif 'ep' in d:
#         return 'ep'
#     elif 'sn' in d:
#         return 'sn'
#     else:
#         return 'sp'

# def gender(d):
#     if 'm' in d:
#         return 'male'
#     else:
#         return 'female'
    
# def age(d):
#     if '014' in d:
#         return '0-14'
#     elif '1524' in d:
#         return '15-24'
#     elif '2534' in d:
#         return '25-34'
#     elif '3544' in d:
#         return '35-44'
#     elif '4554' in d:
#         return '45-54'
#     elif '5564' in d:
#         return '55-64'
#     else:
#         return '65+'
        
# who3['type'] = who3['case_type'].apply(lambda x: type(x))
# who3['gender'] = who3['case_type'].apply(lambda x: gender(x))
# who3['age_group'] = who3['case_type'].apply(lambda x: age(x))
# who3.drop("case_type", axis=1, inplace = True)

# display(who3)


#G = C.copy() # If you do not use copy function the original data frame is modified
#G['year'] = G['year'].apply(lambda x: "'{:02d}".format(x % 100))

GROUP BY

In [78]:
# segment_groups = flights_cols_subset.groupby(['ORIGIN_AIRPORT_ID', 'DEST_AIRPORT_ID'], as_index=False)
# segments = segment_groups.count()

# segments[['ORIGIN_AIRPORT_ID', 'FL_COUNT']].groupby('ORIGIN_AIRPORT_ID', as_index=False) \
#             .agg({'FL_COUNT':"count"})

irises.describe()
irises['sepal length'].head()
irises[["sepal length", "petal width"]].head()
irises.iloc[5:10]
irises[irises["sepal length"] > 5.0]
irises["sepal length"].max()
irises['species'].unique()
irises.sort_values(by="sepal length", ascending=False).head(1)
irises.sort_values(by="sepal length", ascending=False).iloc[5:10]
irises.sort_values(by="sepal length", ascending=False).loc[5:10]
irises['x'] = 3.14
irises.rename(columns={'species': 'type'})
del irises['x']